{"format": "layers-model", "generatedBy": "keras v2.11.0", "convertedBy": "TensorFlow.js Converter v3.18.0", "modelTopology": {"keras_version": "2.11.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_4", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 42], "dtype": "float64", "sparse": false, "ragged": false, "name": "dense_18_input"}}, {"class_name": "Dense", "config": {"name": "dense_18", "trainable": true, "dtype": "float32", "units": 1024, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_14", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_19", "trainable": true, "dtype": "float32", "units": 632, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_15", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_20", "trainable": true, "dtype": "float32", "units": 328, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_16", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_21", "trainable": true, "dtype": "float32", "units": 152, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_17", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_22", "trainable": true, "dtype": "float32", "units": 35, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "sparse_categorical_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "sparse_categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Custom>Adam", "config": {"name": "Adam", "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "jit_compile": false, "is_legacy_optimizer": false, "learning_rate": 0.0010000000474974513, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "dense_18/kernel", "shape": [42, 1024], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.47042178793794603, "scale": 1.505542430832574e-05, "original_dtype": "float32"}}, {"name": "dense_18/bias", "shape": [1024], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.22077918497604937, "scale": 5.549446636236913e-06, "original_dtype": "float32"}}, {"name": "dense_19/kernel", "shape": [1024, 632], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.49068123832523497, "scale": 1.3758060797006448e-05, "original_dtype": "float32"}}, {"name": "dense_19/bias", "shape": [632], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.19272478292515344, "scale": 5.7321034716897696e-06, "original_dtype": "float32"}}, {"name": "dense_20/kernel", "shape": [632, 328], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.42692826093994, "scale": 1.2881789298773158e-05, "original_dtype": "float32"}}, {"name": "dense_20/bias", "shape": [328], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.27569845742079546, "scale": 7.383066183407301e-06, "original_dtype": "float32"}}, {"name": "dense_21/kernel", "shape": [328, 152], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.4382697919026805, "scale": 1.3428206137100329e-05, "original_dtype": "float32"}}, {"name": "dense_21/bias", "shape": [152], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.21852459235404897, "scale": 8.248701206177298e-06, "original_dtype": "float32"}}, {"name": "dense_22/kernel", "shape": [152, 35], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.5992057946441902, "scale": 1.3082524663643295e-05, "original_dtype": "float32"}}, {"name": "dense_22/bias", "shape": [35], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.6037116869277936, "scale": 1.543230283557755e-05, "original_dtype": "float32"}}]}]}